Revit 2018 API
ModelPathUtils Members
The ModelPathUtils type exposes the following members.
Methods
Name | Description
ConvertModelPathToUserVisiblePath
 Gets a string version of the path of a given ModelPath.
ConvertUserVisiblePathToModelPath
 Converts a user-visible path (string) to a ModelPath.
IsValidUserVisibleFullServerPath
 Determines whether the given string represents a valid server path.
See Also
ModelPathUtils Class
Autodesk.Revit.DB Namespace